GopalSaraf/Practicals/PSDL/include/proc/pic18f25k42.inc
// Register: PMD0
#define PMD0 PMD0
PMD0                                     equ 039C0h
// bitfield definitions
PMD0_IOCMD_POSN                          equ 0000h
PMD0_IOCMD_POSITION                      equ 0000h
PMD0_IOCMD_SIZE                          equ 0001h
PMD0_IOCMD_LENGTH                        equ 0001h
PMD0_IOCMD_MASK                          equ 0001h
PMD0_CLKRMD_POSN                         equ 0001h
PMD0_CLKRMD_POSITION                     equ 0001h
PMD0_CLKRMD_SIZE                         equ 0001h
PMD0_CLKRMD_LENGTH                       equ 0001h
PMD0_CLKRMD_MASK                         equ 0002h
PMD0_NVMMD_POSN                          equ 0002h
PMD0_NVMMD_POSITION                      equ 0002h
PMD0_NVMMD_SIZE                          equ 0001h
PMD0_NVMMD_LENGTH                        equ 0001h
PMD0_NVMMD_MASK                          equ 0004h
PMD0_SCANMD_POSN                         equ 0003h
PMD0_SCANMD_POSITION                     equ 0003h
PMD0_SCANMD_SIZE                         equ 0001h
PMD0_SCANMD_LENGTH                       equ 0001h
PMD0_SCANMD_MASK                         equ 0008h
PMD0_CRCMD_POSN                          equ 0004h
PMD0_CRCMD_POSITION                      equ 0004h
PMD0_CRCMD_SIZE                          equ 0001h
PMD0_CRCMD_LENGTH                        equ 0001h
PMD0_CRCMD_MASK                          equ 0010h
PMD0_HLVDMD_POSN                         equ 0005h
PMD0_HLVDMD_POSITION                     equ 0005h
PMD0_HLVDMD_SIZE                         equ 0001h
PMD0_HLVDMD_LENGTH                       equ 0001h
PMD0_HLVDMD_MASK                         equ 0020h
PMD0_FVRMD_POSN                          equ 0006h
PMD0_FVRMD_POSITION                      equ 0006h
PMD0_FVRMD_SIZE                          equ 0001h
PMD0_FVRMD_LENGTH                        equ 0001h
PMD0_FVRMD_MASK                          equ 0040h
PMD0_SYSCMD_POSN                         equ 0007h
PMD0_SYSCMD_POSITION                     equ 0007h
PMD0_SYSCMD_SIZE                         equ 0001h
PMD0_SYSCMD_LENGTH                       equ 0001h
PMD0_SYSCMD_MASK                         equ 0080h

// Register: PMD1
#define PMD1 PMD1
PMD1                                     equ 039C1h
// bitfield definitions
PMD1_TMR0MD_POSN                         equ 0000h
PMD1_TMR0MD_POSITION                     equ 0000h
PMD1_TMR0MD_SIZE                         equ 0001h
PMD1_TMR0MD_LENGTH                       equ 0001h
PMD1_TMR0MD_MASK                         equ 0001h
PMD1_TMR1MD_POSN                         equ 0001h
PMD1_TMR1MD_POSITION                     equ 0001h
PMD1_TMR1MD_SIZE                         equ 0001h
PMD1_TMR1MD_LENGTH                       equ 0001h
PMD1_TMR1MD_MASK                         equ 0002h
PMD1_TMR2MD_POSN                         equ 0002h
PMD1_TMR2MD_POSITION                     equ 0002h
PMD1_TMR2MD_SIZE                         equ 0001h
PMD1_TMR2MD_LENGTH                       equ 0001h
PMD1_TMR2MD_MASK                         equ 0004h
PMD1_TMR3MD_POSN                         equ 0003h
PMD1_TMR3MD_POSITION                     equ 0003h
PMD1_TMR3MD_SIZE                         equ 0001h
PMD1_TMR3MD_LENGTH                       equ 0001h
PMD1_TMR3MD_MASK                         equ 0008h
PMD1_TMR4MD_POSN                         equ 0004h
PMD1_TMR4MD_POSITION                     equ 0004h
PMD1_TMR4MD_SIZE                         equ 0001h
PMD1_TMR4MD_LENGTH                       equ 0001h
PMD1_TMR4MD_MASK                         equ 0010h
PMD1_TMR5MD_POSN                         equ 0005h
PMD1_TMR5MD_POSITION                     equ 0005h
PMD1_TMR5MD_SIZE                         equ 0001h
PMD1_TMR5MD_LENGTH                       equ 0001h
PMD1_TMR5MD_MASK                         equ 0020h
PMD1_TMR6MD_POSN                         equ 0006h
PMD1_TMR6MD_POSITION                     equ 0006h
PMD1_TMR6MD_SIZE                         equ 0001h
PMD1_TMR6MD_LENGTH                       equ 0001h
PMD1_TMR6MD_MASK                         equ 0040h
PMD1_NCO1MD_POSN                         equ 0007h
PMD1_NCO1MD_POSITION                     equ 0007h
PMD1_NCO1MD_SIZE                         equ 0001h
PMD1_NCO1MD_LENGTH                       equ 0001h
PMD1_NCO1MD_MASK                         equ 0080h

// Register: PMD2
#define PMD2 PMD2
PMD2                                     equ 039C2h
// bitfield definitions
PMD2_ZCDMD_POSN                          equ 0000h
PMD2_ZCDMD_POSITION                      equ 0000h
PMD2_ZCDMD_SIZE                          equ 0001h
PMD2_ZCDMD_LENGTH                        equ 0001h
PMD2_ZCDMD_MASK                          equ 0001h
PMD2_CMP1MD_POSN                         equ 0001h
PMD2_CMP1MD_POSITION                     equ 0001h
PMD2_CMP1MD_SIZE                         equ 0001h
PMD2_CMP1MD_LENGTH                       equ 0001h
PMD2_CMP1MD_MASK                         equ 0002h
PMD2_CMP2MD_POSN                         equ 0002h
PMD2_CMP2MD_POSITION                     equ 0002h
PMD2_CMP2MD_SIZE                         equ 0001h
PMD2_CMP2MD_LENGTH                       equ 0001h
PMD2_CMP2MD_MASK                         equ 0004h
PMD2_ADCMD_POSN                          equ 0005h
PMD2_ADCMD_POSITION                      equ 0005h
PMD2_ADCMD_SIZE                          equ 0001h
PMD2_ADCMD_LENGTH                        equ 0001h
PMD2_ADCMD_MASK                          equ 0020h
PMD2_DACMD_POSN                          equ 0006h
PMD2_DACMD_POSITION                      equ 0006h
PMD2_DACMD_SIZE                          equ 0001h
PMD2_DACMD_LENGTH                        equ 0001h
PMD2_DACMD_MASK                          equ 0040h

// Register: PMD3
#define PMD3 PMD3
PMD3                                     equ 039C3h
// bitfield definitions
PMD3_CCP1MD_POSN                         equ 0000h
PMD3_CCP1MD_POSITION                     equ 0000h
PMD3_CCP1MD_SIZE                         equ 0001h
PMD3_CCP1MD_LENGTH                       equ 0001h
PMD3_CCP1MD_MASK                         equ 0001h
PMD3_CCP2MD_POSN                         equ 0001h
PMD3_CCP2MD_POSITION                     equ 0001h
PMD3_CCP2MD_SIZE                         equ 0001h
PMD3_CCP2MD_LENGTH                       equ 0001h
PMD3_CCP2MD_MASK                         equ 0002h
PMD3_CCP3MD_POSN                         equ 0002h
PMD3_CCP3MD_POSITION                     equ 0002h
PMD3_CCP3MD_SIZE                         equ 0001h
PMD3_CCP3MD_LENGTH                       equ 0001h
PMD3_CCP3MD_MASK                         equ 0004h
PMD3_CCP4MD_POSN                         equ 0003h
PMD3_CCP4MD_POSITION                     equ 0003h
PMD3_CCP4MD_SIZE                         equ 0001h
PMD3_CCP4MD_LENGTH                       equ 0001h
PMD3_CCP4MD_MASK                         equ 0008h
PMD3_PWM5MD_POSN                         equ 0004h
PMD3_PWM5MD_POSITION                     equ 0004h
PMD3_PWM5MD_SIZE                         equ 0001h
PMD3_PWM5MD_LENGTH                       equ 0001h
PMD3_PWM5MD_MASK                         equ 0010h
PMD3_PWM6MD_POSN                         equ 0005h
PMD3_PWM6MD_POSITION                     equ 0005h
PMD3_PWM6MD_SIZE                         equ 0001h
PMD3_PWM6MD_LENGTH                       equ 0001h
PMD3_PWM6MD_MASK                         equ 0020h
PMD3_PWM7MD_POSN                         equ 0006h
PMD3_PWM7MD_POSITION                     equ 0006h
PMD3_PWM7MD_SIZE                         equ 0001h
PMD3_PWM7MD_LENGTH                       equ 0001h
PMD3_PWM7MD_MASK                         equ 0040h
PMD3_PWM8MD_POSN                         equ 0007h
PMD3_PWM8MD_POSITION                     equ 0007h
PMD3_PWM8MD_SIZE                         equ 0001h
PMD3_PWM8MD_LENGTH                       equ 0001h
PMD3_PWM8MD_MASK                         equ 0080h

// Register: PMD4
#define PMD4 PMD4
PMD4                                     equ 039C4h
// bitfield definitions
PMD4_CWG1MD_POSN                         equ 0005h
PMD4_CWG1MD_POSITION                     equ 0005h
PMD4_CWG1MD_SIZE                         equ 0001h
PMD4_CWG1MD_LENGTH                       equ 0001h
PMD4_CWG1MD_MASK                         equ 0020h
PMD4_CWG2MD_POSN                         equ 0006h
PMD4_CWG2MD_POSITION                     equ 0006h
PMD4_CWG2MD_SIZE                         equ 0001h
PMD4_CWG2MD_LENGTH                       equ 0001h
PMD4_CWG2MD_MASK                         equ 0040h
PMD4_CWG3MD_POSN                         equ 0007h
PMD4_CWG3MD_POSITION                     equ 0007h
PMD4_CWG3MD_SIZE                         equ 0001h
PMD4_CWG3MD_LENGTH                       equ 0001h
PMD4_CWG3MD_MASK                         equ 0080h

// Register: PMD5
#define PMD5 PMD5
PMD5                                     equ 039C5h
// bitfield definitions
PMD5_I2C1MD_POSN                         equ 0000h
PMD5_I2C1MD_POSITION                     equ 0000h
PMD5_I2C1MD_SIZE                         equ 0001h
PMD5_I2C1MD_LENGTH                       equ 0001h
PMD5_I2C1MD_MASK                         equ 0001h
PMD5_I2C2MD_POSN                         equ 0001h
PMD5_I2C2MD_POSITION                     equ 0001h
PMD5_I2C2MD_SIZE                         equ 0001h
PMD5_I2C2MD_LENGTH                       equ 0001h
PMD5_I2C2MD_MASK                         equ 0002h
PMD5_SPI1MD_POSN                         equ 0002h
PMD5_SPI1MD_POSITION                     equ 0002h
PMD5_SPI1MD_SIZE                         equ 0001h
PMD5_SPI1MD_LENGTH                       equ 0001h
PMD5_SPI1MD_MASK                         equ 0004h
PMD5_U1MD_POSN                           equ 0004h
PMD5_U1MD_POSITION                       equ 0004h
PMD5_U1MD_SIZE                           equ 0001h
PMD5_U1MD_LENGTH                         equ 0001h
PMD5_U1MD_MASK                           equ 0010h
PMD5_U2MD_POSN                           equ 0005h
PMD5_U2MD_POSITION                       equ 0005h
PMD5_U2MD_SIZE                           equ 0001h
PMD5_U2MD_LENGTH                         equ 0001h
PMD5_U2MD_MASK                           equ 0020h

// Register: PMD6
#define PMD6 PMD6
PMD6                                     equ 039C6h
// bitfield definitions
PMD6_DSMMD_POSN                          equ 0000h
PMD6_DSMMD_POSITION                      equ 0000h
PMD6_DSMMD_SIZE                          equ 0001h
PMD6_DSMMD_LENGTH                        equ 0001h
PMD6_DSMMD_MASK                          equ 0001h
PMD6_CLC1MD_POSN                         equ 0001h
PMD6_CLC1MD_POSITION                     equ 0001h
PMD6_CLC1MD_SIZE                         equ 0001h
PMD6_CLC1MD_LENGTH                       equ 0001h
PMD6_CLC1MD_MASK                         equ 0002h
PMD6_CLC2MD_POSN                         equ 0002h
PMD6_CLC2MD_POSITION                     equ 0002h
PMD6_CLC2MD_SIZE                         equ 0001h
PMD6_CLC2MD_LENGTH                       equ 0001h
PMD6_CLC2MD_MASK                         equ 0004h
PMD6_CLC3MD_POSN                         equ 0003h
PMD6_CLC3MD_POSITION                     equ 0003h
PMD6_CLC3MD_SIZE                         equ 0001h
PMD6_CLC3MD_LENGTH                       equ 0001h
PMD6_CLC3MD_MASK                         equ 0008h
PMD6_CLC4MD_POSN                         equ 0004h
PMD6_CLC4MD_POSITION                     equ 0004h
PMD6_CLC4MD_SIZE                         equ 0001h
PMD6_CLC4MD_LENGTH                       equ 0001h
PMD6_CLC4MD_MASK                         equ 0010h
PMD6_SMT1MD_POSN                         equ 0005h
PMD6_SMT1MD_POSITION                     equ 0005h
PMD6_SMT1MD_SIZE                         equ 0001h
PMD6_SMT1MD_LENGTH                       equ 0001h
PMD6_SMT1MD_MASK                         equ 0020h

// Register: PMD7
#define PMD7 PMD7
PMD7                                     equ 039C7h
// bitfield definitions
PMD7_DMA1MD_POSN                         equ 0000h
PMD7_DMA1MD_POSITION                     equ 0000h
PMD7_DMA1MD_SIZE                         equ 0001h
PMD7_DMA1MD_LENGTH                       equ 0001h
PMD7_DMA1MD_MASK                         equ 0001h
PMD7_DMA2MD_POSN                         equ 0001h
PMD7_DMA2MD_POSITION                     equ 0001h
PMD7_DMA2MD_SIZE                         equ 0001h
PMD7_DMA2MD_LENGTH                       equ 0001h
PMD7_DMA2MD_MASK                         equ 0002h

// Register: BORCON
#define BORCON BORCON
BORCON                                   equ 039D0h
// bitfield definitions
BORCON_BORRDY_POSN                       equ 0000h
BORCON_BORRDY_POSITION                   equ 0000h
BORCON_BORRDY_SIZE                       equ 0001h
BORCON_BORRDY_LENGTH                     equ 0001h
BORCON_BORRDY_MASK                       equ 0001h
BORCON_SBOREN_POSN                       equ 0007h
BORCON_SBOREN_POSITION                   equ 0007h
BORCON_SBOREN_SIZE                       equ 0001h
BORCON_SBOREN_LENGTH                     equ 0001h
BORCON_SBOREN_MASK                       equ 0080h

// Register: VREGCON
#define VREGCON VREGCON
VREGCON                                  equ 039D1h
// bitfield definitions
VREGCON_VREGPM_POSN                      equ 0001h
VREGCON_VREGPM_POSITION                  equ 0001h
VREGCON_VREGPM_SIZE                      equ 0001h
VREGCON_VREGPM_LENGTH                    equ 0001h
VREGCON_VREGPM_MASK                      equ 0002h

