GopalSaraf/Practicals/PSDL/include/proc/pic18f25k42.inc
// Register: DMA2SPTRH
#define DMA2SPTRH DMA2SPTRH
DMA2SPTRH                                equ 03BD5h
// bitfield definitions
DMA2SPTRH_SPTR_POSN                      equ 0000h
DMA2SPTRH_SPTR_POSITION                  equ 0000h
DMA2SPTRH_SPTR_SIZE                      equ 0008h
DMA2SPTRH_SPTR_LENGTH                    equ 0008h
DMA2SPTRH_SPTR_MASK                      equ 00FFh
DMA2SPTRH_SPTR8_POSN                     equ 0000h
DMA2SPTRH_SPTR8_POSITION                 equ 0000h
DMA2SPTRH_SPTR8_SIZE                     equ 0001h
DMA2SPTRH_SPTR8_LENGTH                   equ 0001h
DMA2SPTRH_SPTR8_MASK                     equ 0001h
DMA2SPTRH_SPTR9_POSN                     equ 0001h
DMA2SPTRH_SPTR9_POSITION                 equ 0001h
DMA2SPTRH_SPTR9_SIZE                     equ 0001h
DMA2SPTRH_SPTR9_LENGTH                   equ 0001h
DMA2SPTRH_SPTR9_MASK                     equ 0002h
DMA2SPTRH_SPTR10_POSN                    equ 0002h
DMA2SPTRH_SPTR10_POSITION                equ 0002h
DMA2SPTRH_SPTR10_SIZE                    equ 0001h
DMA2SPTRH_SPTR10_LENGTH                  equ 0001h
DMA2SPTRH_SPTR10_MASK                    equ 0004h
DMA2SPTRH_SPTR11_POSN                    equ 0003h
DMA2SPTRH_SPTR11_POSITION                equ 0003h
DMA2SPTRH_SPTR11_SIZE                    equ 0001h
DMA2SPTRH_SPTR11_LENGTH                  equ 0001h
DMA2SPTRH_SPTR11_MASK                    equ 0008h
DMA2SPTRH_SPTR12_POSN                    equ 0004h
DMA2SPTRH_SPTR12_POSITION                equ 0004h
DMA2SPTRH_SPTR12_SIZE                    equ 0001h
DMA2SPTRH_SPTR12_LENGTH                  equ 0001h
DMA2SPTRH_SPTR12_MASK                    equ 0010h
DMA2SPTRH_SPTR13_POSN                    equ 0005h
DMA2SPTRH_SPTR13_POSITION                equ 0005h
DMA2SPTRH_SPTR13_SIZE                    equ 0001h
DMA2SPTRH_SPTR13_LENGTH                  equ 0001h
DMA2SPTRH_SPTR13_MASK                    equ 0020h
DMA2SPTRH_SPTR14_POSN                    equ 0006h
DMA2SPTRH_SPTR14_POSITION                equ 0006h
DMA2SPTRH_SPTR14_SIZE                    equ 0001h
DMA2SPTRH_SPTR14_LENGTH                  equ 0001h
DMA2SPTRH_SPTR14_MASK                    equ 0040h
DMA2SPTRH_SPTR15_POSN                    equ 0007h
DMA2SPTRH_SPTR15_POSITION                equ 0007h
DMA2SPTRH_SPTR15_SIZE                    equ 0001h
DMA2SPTRH_SPTR15_LENGTH                  equ 0001h
DMA2SPTRH_SPTR15_MASK                    equ 0080h
DMA2SPTRH_DMA2SPTR_POSN                  equ 0000h
DMA2SPTRH_DMA2SPTR_POSITION              equ 0000h
DMA2SPTRH_DMA2SPTR_SIZE                  equ 0008h
DMA2SPTRH_DMA2SPTR_LENGTH                equ 0008h
DMA2SPTRH_DMA2SPTR_MASK                  equ 00FFh
DMA2SPTRH_DMA2SPTR8_POSN                 equ 0000h
DMA2SPTRH_DMA2SPTR8_POSITION             equ 0000h
DMA2SPTRH_DMA2SPTR8_SIZE                 equ 0001h
DMA2SPTRH_DMA2SPTR8_LENGTH               equ 0001h
DMA2SPTRH_DMA2SPTR8_MASK                 equ 0001h
DMA2SPTRH_DMA2SPTR9_POSN                 equ 0001h
DMA2SPTRH_DMA2SPTR9_POSITION             equ 0001h
DMA2SPTRH_DMA2SPTR9_SIZE                 equ 0001h
DMA2SPTRH_DMA2SPTR9_LENGTH               equ 0001h
DMA2SPTRH_DMA2SPTR9_MASK                 equ 0002h
DMA2SPTRH_DMA2SPTR10_POSN                equ 0002h
DMA2SPTRH_DMA2SPTR10_POSITION            equ 0002h
DMA2SPTRH_DMA2SPTR10_SIZE                equ 0001h
DMA2SPTRH_DMA2SPTR10_LENGTH              equ 0001h
DMA2SPTRH_DMA2SPTR10_MASK                equ 0004h
DMA2SPTRH_DMA2SPTR11_POSN                equ 0003h
DMA2SPTRH_DMA2SPTR11_POSITION            equ 0003h
DMA2SPTRH_DMA2SPTR11_SIZE                equ 0001h
DMA2SPTRH_DMA2SPTR11_LENGTH              equ 0001h
DMA2SPTRH_DMA2SPTR11_MASK                equ 0008h
DMA2SPTRH_DMA2SPTR12_POSN                equ 0004h
DMA2SPTRH_DMA2SPTR12_POSITION            equ 0004h
DMA2SPTRH_DMA2SPTR12_SIZE                equ 0001h
DMA2SPTRH_DMA2SPTR12_LENGTH              equ 0001h
DMA2SPTRH_DMA2SPTR12_MASK                equ 0010h
DMA2SPTRH_DMA2SPTR13_POSN                equ 0005h
DMA2SPTRH_DMA2SPTR13_POSITION            equ 0005h
DMA2SPTRH_DMA2SPTR13_SIZE                equ 0001h
DMA2SPTRH_DMA2SPTR13_LENGTH              equ 0001h
DMA2SPTRH_DMA2SPTR13_MASK                equ 0020h
DMA2SPTRH_DMA2SPTR14_POSN                equ 0006h
DMA2SPTRH_DMA2SPTR14_POSITION            equ 0006h
DMA2SPTRH_DMA2SPTR14_SIZE                equ 0001h
DMA2SPTRH_DMA2SPTR14_LENGTH              equ 0001h
DMA2SPTRH_DMA2SPTR14_MASK                equ 0040h
DMA2SPTRH_DMA2SPTR15_POSN                equ 0007h
DMA2SPTRH_DMA2SPTR15_POSITION            equ 0007h
DMA2SPTRH_DMA2SPTR15_SIZE                equ 0001h
DMA2SPTRH_DMA2SPTR15_LENGTH              equ 0001h
DMA2SPTRH_DMA2SPTR15_MASK                equ 0080h

// Register: DMA2SPTRU
#define DMA2SPTRU DMA2SPTRU
DMA2SPTRU                                equ 03BD6h
// bitfield definitions
DMA2SPTRU_SPTR_POSN                      equ 0000h
DMA2SPTRU_SPTR_POSITION                  equ 0000h
DMA2SPTRU_SPTR_SIZE                      equ 0006h
DMA2SPTRU_SPTR_LENGTH                    equ 0006h
DMA2SPTRU_SPTR_MASK                      equ 003Fh
DMA2SPTRU_SPTR16_POSN                    equ 0000h
DMA2SPTRU_SPTR16_POSITION                equ 0000h
DMA2SPTRU_SPTR16_SIZE                    equ 0001h
DMA2SPTRU_SPTR16_LENGTH                  equ 0001h
DMA2SPTRU_SPTR16_MASK                    equ 0001h
DMA2SPTRU_SPTR17_POSN                    equ 0001h
DMA2SPTRU_SPTR17_POSITION                equ 0001h
DMA2SPTRU_SPTR17_SIZE                    equ 0001h
DMA2SPTRU_SPTR17_LENGTH                  equ 0001h
DMA2SPTRU_SPTR17_MASK                    equ 0002h
DMA2SPTRU_SPTR18_POSN                    equ 0002h
DMA2SPTRU_SPTR18_POSITION                equ 0002h
DMA2SPTRU_SPTR18_SIZE                    equ 0001h
DMA2SPTRU_SPTR18_LENGTH                  equ 0001h
DMA2SPTRU_SPTR18_MASK                    equ 0004h
DMA2SPTRU_SPTR19_POSN                    equ 0003h
DMA2SPTRU_SPTR19_POSITION                equ 0003h
DMA2SPTRU_SPTR19_SIZE                    equ 0001h
DMA2SPTRU_SPTR19_LENGTH                  equ 0001h
DMA2SPTRU_SPTR19_MASK                    equ 0008h
DMA2SPTRU_SPTR20_POSN                    equ 0004h
DMA2SPTRU_SPTR20_POSITION                equ 0004h
DMA2SPTRU_SPTR20_SIZE                    equ 0001h
DMA2SPTRU_SPTR20_LENGTH                  equ 0001h
DMA2SPTRU_SPTR20_MASK                    equ 0010h
DMA2SPTRU_SPTR21_POSN                    equ 0005h
DMA2SPTRU_SPTR21_POSITION                equ 0005h
DMA2SPTRU_SPTR21_SIZE                    equ 0001h
DMA2SPTRU_SPTR21_LENGTH                  equ 0001h
DMA2SPTRU_SPTR21_MASK                    equ 0020h
DMA2SPTRU_DMA2SPTR_POSN                  equ 0000h
DMA2SPTRU_DMA2SPTR_POSITION              equ 0000h
DMA2SPTRU_DMA2SPTR_SIZE                  equ 0006h
DMA2SPTRU_DMA2SPTR_LENGTH                equ 0006h
DMA2SPTRU_DMA2SPTR_MASK                  equ 003Fh
DMA2SPTRU_DMA2SPTR16_POSN                equ 0000h
DMA2SPTRU_DMA2SPTR16_POSITION            equ 0000h
DMA2SPTRU_DMA2SPTR16_SIZE                equ 0001h
DMA2SPTRU_DMA2SPTR16_LENGTH              equ 0001h
DMA2SPTRU_DMA2SPTR16_MASK                equ 0001h
DMA2SPTRU_DMA2SPTR17_POSN                equ 0001h
DMA2SPTRU_DMA2SPTR17_POSITION            equ 0001h
DMA2SPTRU_DMA2SPTR17_SIZE                equ 0001h
DMA2SPTRU_DMA2SPTR17_LENGTH              equ 0001h
DMA2SPTRU_DMA2SPTR17_MASK                equ 0002h
DMA2SPTRU_DMA2SPTR18_POSN                equ 0002h
DMA2SPTRU_DMA2SPTR18_POSITION            equ 0002h
DMA2SPTRU_DMA2SPTR18_SIZE                equ 0001h
DMA2SPTRU_DMA2SPTR18_LENGTH              equ 0001h
DMA2SPTRU_DMA2SPTR18_MASK                equ 0004h
DMA2SPTRU_DMA2SPTR19_POSN                equ 0003h
DMA2SPTRU_DMA2SPTR19_POSITION            equ 0003h
DMA2SPTRU_DMA2SPTR19_SIZE                equ 0001h
DMA2SPTRU_DMA2SPTR19_LENGTH              equ 0001h
DMA2SPTRU_DMA2SPTR19_MASK                equ 0008h
DMA2SPTRU_DMA2SPTR20_POSN                equ 0004h
DMA2SPTRU_DMA2SPTR20_POSITION            equ 0004h
DMA2SPTRU_DMA2SPTR20_SIZE                equ 0001h
DMA2SPTRU_DMA2SPTR20_LENGTH              equ 0001h
DMA2SPTRU_DMA2SPTR20_MASK                equ 0010h
DMA2SPTRU_DMA2SPTR21_POSN                equ 0005h
DMA2SPTRU_DMA2SPTR21_POSITION            equ 0005h
DMA2SPTRU_DMA2SPTR21_SIZE                equ 0001h
DMA2SPTRU_DMA2SPTR21_LENGTH              equ 0001h
DMA2SPTRU_DMA2SPTR21_MASK                equ 0020h

// Register: DMA2SSZ
#define DMA2SSZ DMA2SSZ
DMA2SSZ                                  equ 03BD7h

// Register: DMA2SSZL
#define DMA2SSZL DMA2SSZL
DMA2SSZL                                 equ 03BD7h
// bitfield definitions
DMA2SSZL_SSZ_POSN                        equ 0000h
DMA2SSZL_SSZ_POSITION                    equ 0000h
DMA2SSZL_SSZ_SIZE                        equ 0008h
DMA2SSZL_SSZ_LENGTH                      equ 0008h
DMA2SSZL_SSZ_MASK                        equ 00FFh
DMA2SSZL_DMA2SSZ_POSN                    equ 0000h
DMA2SSZL_DMA2SSZ_POSITION                equ 0000h
DMA2SSZL_DMA2SSZ_SIZE                    equ 0008h
DMA2SSZL_DMA2SSZ_LENGTH                  equ 0008h
DMA2SSZL_DMA2SSZ_MASK                    equ 00FFh
DMA2SSZL_SSZ0_POSN                       equ 0000h
DMA2SSZL_SSZ0_POSITION                   equ 0000h
DMA2SSZL_SSZ0_SIZE                       equ 0001h
DMA2SSZL_SSZ0_LENGTH                     equ 0001h
DMA2SSZL_SSZ0_MASK                       equ 0001h
DMA2SSZL_SSZ1_POSN                       equ 0001h
DMA2SSZL_SSZ1_POSITION                   equ 0001h
DMA2SSZL_SSZ1_SIZE                       equ 0001h
DMA2SSZL_SSZ1_LENGTH                     equ 0001h
DMA2SSZL_SSZ1_MASK                       equ 0002h
DMA2SSZL_SSZ2_POSN                       equ 0002h
DMA2SSZL_SSZ2_POSITION                   equ 0002h
DMA2SSZL_SSZ2_SIZE                       equ 0001h
DMA2SSZL_SSZ2_LENGTH                     equ 0001h
DMA2SSZL_SSZ2_MASK                       equ 0004h
DMA2SSZL_SSZ3_POSN                       equ 0003h
DMA2SSZL_SSZ3_POSITION                   equ 0003h
DMA2SSZL_SSZ3_SIZE                       equ 0001h
DMA2SSZL_SSZ3_LENGTH                     equ 0001h
DMA2SSZL_SSZ3_MASK                       equ 0008h
DMA2SSZL_SSZ4_POSN                       equ 0004h
DMA2SSZL_SSZ4_POSITION                   equ 0004h
DMA2SSZL_SSZ4_SIZE                       equ 0001h
DMA2SSZL_SSZ4_LENGTH                     equ 0001h
DMA2SSZL_SSZ4_MASK                       equ 0010h
DMA2SSZL_SSZ5_POSN                       equ 0005h
DMA2SSZL_SSZ5_POSITION                   equ 0005h
DMA2SSZL_SSZ5_SIZE                       equ 0001h
DMA2SSZL_SSZ5_LENGTH                     equ 0001h
DMA2SSZL_SSZ5_MASK                       equ 0020h
DMA2SSZL_SSZ6_POSN                       equ 0006h
DMA2SSZL_SSZ6_POSITION                   equ 0006h
DMA2SSZL_SSZ6_SIZE                       equ 0001h
DMA2SSZL_SSZ6_LENGTH                     equ 0001h
DMA2SSZL_SSZ6_MASK                       equ 0040h
DMA2SSZL_SSZ7_POSN                       equ 0007h
DMA2SSZL_SSZ7_POSITION                   equ 0007h
DMA2SSZL_SSZ7_SIZE                       equ 0001h
DMA2SSZL_SSZ7_LENGTH                     equ 0001h
DMA2SSZL_SSZ7_MASK                       equ 0080h
DMA2SSZL_DMA2SSZ0_POSN                   equ 0000h
DMA2SSZL_DMA2SSZ0_POSITION               equ 0000h
DMA2SSZL_DMA2SSZ0_SIZE                   equ 0001h
DMA2SSZL_DMA2SSZ0_LENGTH                 equ 0001h
DMA2SSZL_DMA2SSZ0_MASK                   equ 0001h
DMA2SSZL_DMA2SSZ1_POSN                   equ 0001h
DMA2SSZL_DMA2SSZ1_POSITION               equ 0001h
DMA2SSZL_DMA2SSZ1_SIZE                   equ 0001h
DMA2SSZL_DMA2SSZ1_LENGTH                 equ 0001h
DMA2SSZL_DMA2SSZ1_MASK                   equ 0002h
DMA2SSZL_DMA2SSZ2_POSN                   equ 0002h
DMA2SSZL_DMA2SSZ2_POSITION               equ 0002h
DMA2SSZL_DMA2SSZ2_SIZE                   equ 0001h
DMA2SSZL_DMA2SSZ2_LENGTH                 equ 0001h
DMA2SSZL_DMA2SSZ2_MASK                   equ 0004h
DMA2SSZL_DMA2SSZ3_POSN                   equ 0003h
DMA2SSZL_DMA2SSZ3_POSITION               equ 0003h
DMA2SSZL_DMA2SSZ3_SIZE                   equ 0001h
DMA2SSZL_DMA2SSZ3_LENGTH                 equ 0001h
DMA2SSZL_DMA2SSZ3_MASK                   equ 0008h
DMA2SSZL_DMA2SSZ4_POSN                   equ 0004h
DMA2SSZL_DMA2SSZ4_POSITION               equ 0004h
DMA2SSZL_DMA2SSZ4_SIZE                   equ 0001h
DMA2SSZL_DMA2SSZ4_LENGTH                 equ 0001h
DMA2SSZL_DMA2SSZ4_MASK                   equ 0010h
DMA2SSZL_DMA2SSZ5_POSN                   equ 0005h
DMA2SSZL_DMA2SSZ5_POSITION               equ 0005h
DMA2SSZL_DMA2SSZ5_SIZE                   equ 0001h
DMA2SSZL_DMA2SSZ5_LENGTH                 equ 0001h
DMA2SSZL_DMA2SSZ5_MASK                   equ 0020h
DMA2SSZL_DMA2SSZ6_POSN                   equ 0006h
DMA2SSZL_DMA2SSZ6_POSITION               equ 0006h
DMA2SSZL_DMA2SSZ6_SIZE                   equ 0001h
DMA2SSZL_DMA2SSZ6_LENGTH                 equ 0001h
DMA2SSZL_DMA2SSZ6_MASK                   equ 0040h
DMA2SSZL_DMA2SSZ7_POSN                   equ 0007h
DMA2SSZL_DMA2SSZ7_POSITION               equ 0007h
DMA2SSZL_DMA2SSZ7_SIZE                   equ 0001h
DMA2SSZL_DMA2SSZ7_LENGTH                 equ 0001h
DMA2SSZL_DMA2SSZ7_MASK                   equ 0080h

