GopalSaraf/Practicals/PSDL/include/proc/pic18f25k42.inc
// Register: DMA1DSAH
#define DMA1DSAH DMA1DSAH
DMA1DSAH                                 equ 03BF1h
// bitfield definitions
DMA1DSAH_DSA_POSN                        equ 0000h
DMA1DSAH_DSA_POSITION                    equ 0000h
DMA1DSAH_DSA_SIZE                        equ 0008h
DMA1DSAH_DSA_LENGTH                      equ 0008h
DMA1DSAH_DSA_MASK                        equ 00FFh
DMA1DSAH_DSA8_POSN                       equ 0000h
DMA1DSAH_DSA8_POSITION                   equ 0000h
DMA1DSAH_DSA8_SIZE                       equ 0001h
DMA1DSAH_DSA8_LENGTH                     equ 0001h
DMA1DSAH_DSA8_MASK                       equ 0001h
DMA1DSAH_DSA9_POSN                       equ 0001h
DMA1DSAH_DSA9_POSITION                   equ 0001h
DMA1DSAH_DSA9_SIZE                       equ 0001h
DMA1DSAH_DSA9_LENGTH                     equ 0001h
DMA1DSAH_DSA9_MASK                       equ 0002h
DMA1DSAH_DSA10_POSN                      equ 0002h
DMA1DSAH_DSA10_POSITION                  equ 0002h
DMA1DSAH_DSA10_SIZE                      equ 0001h
DMA1DSAH_DSA10_LENGTH                    equ 0001h
DMA1DSAH_DSA10_MASK                      equ 0004h
DMA1DSAH_DSA11_POSN                      equ 0003h
DMA1DSAH_DSA11_POSITION                  equ 0003h
DMA1DSAH_DSA11_SIZE                      equ 0001h
DMA1DSAH_DSA11_LENGTH                    equ 0001h
DMA1DSAH_DSA11_MASK                      equ 0008h
DMA1DSAH_DSA12_POSN                      equ 0004h
DMA1DSAH_DSA12_POSITION                  equ 0004h
DMA1DSAH_DSA12_SIZE                      equ 0001h
DMA1DSAH_DSA12_LENGTH                    equ 0001h
DMA1DSAH_DSA12_MASK                      equ 0010h
DMA1DSAH_DSA13_POSN                      equ 0005h
DMA1DSAH_DSA13_POSITION                  equ 0005h
DMA1DSAH_DSA13_SIZE                      equ 0001h
DMA1DSAH_DSA13_LENGTH                    equ 0001h
DMA1DSAH_DSA13_MASK                      equ 0020h
DMA1DSAH_DSA14_POSN                      equ 0006h
DMA1DSAH_DSA14_POSITION                  equ 0006h
DMA1DSAH_DSA14_SIZE                      equ 0001h
DMA1DSAH_DSA14_LENGTH                    equ 0001h
DMA1DSAH_DSA14_MASK                      equ 0040h
DMA1DSAH_DSA15_POSN                      equ 0007h
DMA1DSAH_DSA15_POSITION                  equ 0007h
DMA1DSAH_DSA15_SIZE                      equ 0001h
DMA1DSAH_DSA15_LENGTH                    equ 0001h
DMA1DSAH_DSA15_MASK                      equ 0080h
DMA1DSAH_DMA1DSA_POSN                    equ 0000h
DMA1DSAH_DMA1DSA_POSITION                equ 0000h
DMA1DSAH_DMA1DSA_SIZE                    equ 0008h
DMA1DSAH_DMA1DSA_LENGTH                  equ 0008h
DMA1DSAH_DMA1DSA_MASK                    equ 00FFh
DMA1DSAH_DMA1DSA8_POSN                   equ 0000h
DMA1DSAH_DMA1DSA8_POSITION               equ 0000h
DMA1DSAH_DMA1DSA8_SIZE                   equ 0001h
DMA1DSAH_DMA1DSA8_LENGTH                 equ 0001h
DMA1DSAH_DMA1DSA8_MASK                   equ 0001h
DMA1DSAH_DMA1DSA9_POSN                   equ 0001h
DMA1DSAH_DMA1DSA9_POSITION               equ 0001h
DMA1DSAH_DMA1DSA9_SIZE                   equ 0001h
DMA1DSAH_DMA1DSA9_LENGTH                 equ 0001h
DMA1DSAH_DMA1DSA9_MASK                   equ 0002h
DMA1DSAH_DMA1DSA10_POSN                  equ 0002h
DMA1DSAH_DMA1DSA10_POSITION              equ 0002h
DMA1DSAH_DMA1DSA10_SIZE                  equ 0001h
DMA1DSAH_DMA1DSA10_LENGTH                equ 0001h
DMA1DSAH_DMA1DSA10_MASK                  equ 0004h
DMA1DSAH_DMA1DSA11_POSN                  equ 0003h
DMA1DSAH_DMA1DSA11_POSITION              equ 0003h
DMA1DSAH_DMA1DSA11_SIZE                  equ 0001h
DMA1DSAH_DMA1DSA11_LENGTH                equ 0001h
DMA1DSAH_DMA1DSA11_MASK                  equ 0008h
DMA1DSAH_DMA1DSA12_POSN                  equ 0004h
DMA1DSAH_DMA1DSA12_POSITION              equ 0004h
DMA1DSAH_DMA1DSA12_SIZE                  equ 0001h
DMA1DSAH_DMA1DSA12_LENGTH                equ 0001h
DMA1DSAH_DMA1DSA12_MASK                  equ 0010h
DMA1DSAH_DMA1DSA13_POSN                  equ 0005h
DMA1DSAH_DMA1DSA13_POSITION              equ 0005h
DMA1DSAH_DMA1DSA13_SIZE                  equ 0001h
DMA1DSAH_DMA1DSA13_LENGTH                equ 0001h
DMA1DSAH_DMA1DSA13_MASK                  equ 0020h
DMA1DSAH_DMA1DSA14_POSN                  equ 0006h
DMA1DSAH_DMA1DSA14_POSITION              equ 0006h
DMA1DSAH_DMA1DSA14_SIZE                  equ 0001h
DMA1DSAH_DMA1DSA14_LENGTH                equ 0001h
DMA1DSAH_DMA1DSA14_MASK                  equ 0040h
DMA1DSAH_DMA1DSA15_POSN                  equ 0007h
DMA1DSAH_DMA1DSA15_POSITION              equ 0007h
DMA1DSAH_DMA1DSA15_SIZE                  equ 0001h
DMA1DSAH_DMA1DSA15_LENGTH                equ 0001h
DMA1DSAH_DMA1DSA15_MASK                  equ 0080h

// Register: DMA1SCNT
#define DMA1SCNT DMA1SCNT
DMA1SCNT                                 equ 03BF2h

// Register: DMA1SCNTL
#define DMA1SCNTL DMA1SCNTL
DMA1SCNTL                                equ 03BF2h
// bitfield definitions
DMA1SCNTL_SCNT_POSN                      equ 0000h
DMA1SCNTL_SCNT_POSITION                  equ 0000h
DMA1SCNTL_SCNT_SIZE                      equ 0008h
DMA1SCNTL_SCNT_LENGTH                    equ 0008h
DMA1SCNTL_SCNT_MASK                      equ 00FFh
DMA1SCNTL_SCNT0_POSN                     equ 0000h
DMA1SCNTL_SCNT0_POSITION                 equ 0000h
DMA1SCNTL_SCNT0_SIZE                     equ 0001h
DMA1SCNTL_SCNT0_LENGTH                   equ 0001h
DMA1SCNTL_SCNT0_MASK                     equ 0001h
DMA1SCNTL_SCNT1_POSN                     equ 0001h
DMA1SCNTL_SCNT1_POSITION                 equ 0001h
DMA1SCNTL_SCNT1_SIZE                     equ 0001h
DMA1SCNTL_SCNT1_LENGTH                   equ 0001h
DMA1SCNTL_SCNT1_MASK                     equ 0002h
DMA1SCNTL_SCNT2_POSN                     equ 0002h
DMA1SCNTL_SCNT2_POSITION                 equ 0002h
DMA1SCNTL_SCNT2_SIZE                     equ 0001h
DMA1SCNTL_SCNT2_LENGTH                   equ 0001h
DMA1SCNTL_SCNT2_MASK                     equ 0004h
DMA1SCNTL_SCNT3_POSN                     equ 0003h
DMA1SCNTL_SCNT3_POSITION                 equ 0003h
DMA1SCNTL_SCNT3_SIZE                     equ 0001h
DMA1SCNTL_SCNT3_LENGTH                   equ 0001h
DMA1SCNTL_SCNT3_MASK                     equ 0008h
DMA1SCNTL_SCNT4_POSN                     equ 0004h
DMA1SCNTL_SCNT4_POSITION                 equ 0004h
DMA1SCNTL_SCNT4_SIZE                     equ 0001h
DMA1SCNTL_SCNT4_LENGTH                   equ 0001h
DMA1SCNTL_SCNT4_MASK                     equ 0010h
DMA1SCNTL_SCNT5_POSN                     equ 0005h
DMA1SCNTL_SCNT5_POSITION                 equ 0005h
DMA1SCNTL_SCNT5_SIZE                     equ 0001h
DMA1SCNTL_SCNT5_LENGTH                   equ 0001h
DMA1SCNTL_SCNT5_MASK                     equ 0020h
DMA1SCNTL_SCNT6_POSN                     equ 0006h
DMA1SCNTL_SCNT6_POSITION                 equ 0006h
DMA1SCNTL_SCNT6_SIZE                     equ 0001h
DMA1SCNTL_SCNT6_LENGTH                   equ 0001h
DMA1SCNTL_SCNT6_MASK                     equ 0040h
DMA1SCNTL_SCNT7_POSN                     equ 0007h
DMA1SCNTL_SCNT7_POSITION                 equ 0007h
DMA1SCNTL_SCNT7_SIZE                     equ 0001h
DMA1SCNTL_SCNT7_LENGTH                   equ 0001h
DMA1SCNTL_SCNT7_MASK                     equ 0080h
DMA1SCNTL_DMA1SCNT_POSN                  equ 0000h
DMA1SCNTL_DMA1SCNT_POSITION              equ 0000h
DMA1SCNTL_DMA1SCNT_SIZE                  equ 0008h
DMA1SCNTL_DMA1SCNT_LENGTH                equ 0008h
DMA1SCNTL_DMA1SCNT_MASK                  equ 00FFh
DMA1SCNTL_DMA1SCNT0_POSN                 equ 0000h
DMA1SCNTL_DMA1SCNT0_POSITION             equ 0000h
DMA1SCNTL_DMA1SCNT0_SIZE                 equ 0001h
DMA1SCNTL_DMA1SCNT0_LENGTH               equ 0001h
DMA1SCNTL_DMA1SCNT0_MASK                 equ 0001h
DMA1SCNTL_DMA1SCNT1_POSN                 equ 0001h
DMA1SCNTL_DMA1SCNT1_POSITION             equ 0001h
DMA1SCNTL_DMA1SCNT1_SIZE                 equ 0001h
DMA1SCNTL_DMA1SCNT1_LENGTH               equ 0001h
DMA1SCNTL_DMA1SCNT1_MASK                 equ 0002h
DMA1SCNTL_DMA1SCNT2_POSN                 equ 0002h
DMA1SCNTL_DMA1SCNT2_POSITION             equ 0002h
DMA1SCNTL_DMA1SCNT2_SIZE                 equ 0001h
DMA1SCNTL_DMA1SCNT2_LENGTH               equ 0001h
DMA1SCNTL_DMA1SCNT2_MASK                 equ 0004h
DMA1SCNTL_DMA1SCNT3_POSN                 equ 0003h
DMA1SCNTL_DMA1SCNT3_POSITION             equ 0003h
DMA1SCNTL_DMA1SCNT3_SIZE                 equ 0001h
DMA1SCNTL_DMA1SCNT3_LENGTH               equ 0001h
DMA1SCNTL_DMA1SCNT3_MASK                 equ 0008h
DMA1SCNTL_DMA1SCNT4_POSN                 equ 0004h
DMA1SCNTL_DMA1SCNT4_POSITION             equ 0004h
DMA1SCNTL_DMA1SCNT4_SIZE                 equ 0001h
DMA1SCNTL_DMA1SCNT4_LENGTH               equ 0001h
DMA1SCNTL_DMA1SCNT4_MASK                 equ 0010h
DMA1SCNTL_DMA1SCNT5_POSN                 equ 0005h
DMA1SCNTL_DMA1SCNT5_POSITION             equ 0005h
DMA1SCNTL_DMA1SCNT5_SIZE                 equ 0001h
DMA1SCNTL_DMA1SCNT5_LENGTH               equ 0001h
DMA1SCNTL_DMA1SCNT5_MASK                 equ 0020h
DMA1SCNTL_DMA1SCNT6_POSN                 equ 0006h
DMA1SCNTL_DMA1SCNT6_POSITION             equ 0006h
DMA1SCNTL_DMA1SCNT6_SIZE                 equ 0001h
DMA1SCNTL_DMA1SCNT6_LENGTH               equ 0001h
DMA1SCNTL_DMA1SCNT6_MASK                 equ 0040h
DMA1SCNTL_DMA1SCNT7_POSN                 equ 0007h
DMA1SCNTL_DMA1SCNT7_POSITION             equ 0007h
DMA1SCNTL_DMA1SCNT7_SIZE                 equ 0001h
DMA1SCNTL_DMA1SCNT7_LENGTH               equ 0001h
DMA1SCNTL_DMA1SCNT7_MASK                 equ 0080h

// Register: DMA1SCNTH
#define DMA1SCNTH DMA1SCNTH
DMA1SCNTH                                equ 03BF3h
// bitfield definitions
DMA1SCNTH_SCNT_POSN                      equ 0000h
DMA1SCNTH_SCNT_POSITION                  equ 0000h
DMA1SCNTH_SCNT_SIZE                      equ 0004h
DMA1SCNTH_SCNT_LENGTH                    equ 0004h
DMA1SCNTH_SCNT_MASK                      equ 000Fh
DMA1SCNTH_SCNT8_POSN                     equ 0000h
DMA1SCNTH_SCNT8_POSITION                 equ 0000h
DMA1SCNTH_SCNT8_SIZE                     equ 0001h
DMA1SCNTH_SCNT8_LENGTH                   equ 0001h
DMA1SCNTH_SCNT8_MASK                     equ 0001h
DMA1SCNTH_SCNT9_POSN                     equ 0001h
DMA1SCNTH_SCNT9_POSITION                 equ 0001h
DMA1SCNTH_SCNT9_SIZE                     equ 0001h
DMA1SCNTH_SCNT9_LENGTH                   equ 0001h
DMA1SCNTH_SCNT9_MASK                     equ 0002h
DMA1SCNTH_SCNT10_POSN                    equ 0002h
DMA1SCNTH_SCNT10_POSITION                equ 0002h
DMA1SCNTH_SCNT10_SIZE                    equ 0001h
DMA1SCNTH_SCNT10_LENGTH                  equ 0001h
DMA1SCNTH_SCNT10_MASK                    equ 0004h
DMA1SCNTH_SCNT11_POSN                    equ 0003h
DMA1SCNTH_SCNT11_POSITION                equ 0003h
DMA1SCNTH_SCNT11_SIZE                    equ 0001h
DMA1SCNTH_SCNT11_LENGTH                  equ 0001h
DMA1SCNTH_SCNT11_MASK                    equ 0008h
DMA1SCNTH_DMA1SCNT_POSN                  equ 0000h
DMA1SCNTH_DMA1SCNT_POSITION              equ 0000h
DMA1SCNTH_DMA1SCNT_SIZE                  equ 0004h
DMA1SCNTH_DMA1SCNT_LENGTH                equ 0004h
DMA1SCNTH_DMA1SCNT_MASK                  equ 000Fh
DMA1SCNTH_DMA1SCNT8_POSN                 equ 0000h
DMA1SCNTH_DMA1SCNT8_POSITION             equ 0000h
DMA1SCNTH_DMA1SCNT8_SIZE                 equ 0001h
DMA1SCNTH_DMA1SCNT8_LENGTH               equ 0001h
DMA1SCNTH_DMA1SCNT8_MASK                 equ 0001h
DMA1SCNTH_DMA1SCNT9_POSN                 equ 0001h
DMA1SCNTH_DMA1SCNT9_POSITION             equ 0001h
DMA1SCNTH_DMA1SCNT9_SIZE                 equ 0001h
DMA1SCNTH_DMA1SCNT9_LENGTH               equ 0001h
DMA1SCNTH_DMA1SCNT9_MASK                 equ 0002h
DMA1SCNTH_DMA1SCNT10_POSN                equ 0002h
DMA1SCNTH_DMA1SCNT10_POSITION            equ 0002h
DMA1SCNTH_DMA1SCNT10_SIZE                equ 0001h
DMA1SCNTH_DMA1SCNT10_LENGTH              equ 0001h
DMA1SCNTH_DMA1SCNT10_MASK                equ 0004h
DMA1SCNTH_DMA1SCNT11_POSN                equ 0003h
DMA1SCNTH_DMA1SCNT11_POSITION            equ 0003h
DMA1SCNTH_DMA1SCNT11_SIZE                equ 0001h
DMA1SCNTH_DMA1SCNT11_LENGTH              equ 0001h
DMA1SCNTH_DMA1SCNT11_MASK                equ 0008h

// Register: DMA1SPTR
#define DMA1SPTR DMA1SPTR
DMA1SPTR                                 equ 03BF4h

// Register: DMA1SPTRL
#define DMA1SPTRL DMA1SPTRL
DMA1SPTRL                                equ 03BF4h
// bitfield definitions
DMA1SPTRL_SPTR_POSN                      equ 0000h
DMA1SPTRL_SPTR_POSITION                  equ 0000h
DMA1SPTRL_SPTR_SIZE                      equ 0008h
DMA1SPTRL_SPTR_LENGTH                    equ 0008h
DMA1SPTRL_SPTR_MASK                      equ 00FFh
DMA1SPTRL_SPTR0_POSN                     equ 0000h
DMA1SPTRL_SPTR0_POSITION                 equ 0000h
DMA1SPTRL_SPTR0_SIZE                     equ 0001h
DMA1SPTRL_SPTR0_LENGTH                   equ 0001h
DMA1SPTRL_SPTR0_MASK                     equ 0001h
DMA1SPTRL_SPTR1_POSN                     equ 0001h
DMA1SPTRL_SPTR1_POSITION                 equ 0001h
DMA1SPTRL_SPTR1_SIZE                     equ 0001h
DMA1SPTRL_SPTR1_LENGTH                   equ 0001h
DMA1SPTRL_SPTR1_MASK                     equ 0002h
DMA1SPTRL_SPTR2_POSN                     equ 0002h
DMA1SPTRL_SPTR2_POSITION                 equ 0002h
DMA1SPTRL_SPTR2_SIZE                     equ 0001h
DMA1SPTRL_SPTR2_LENGTH                   equ 0001h
DMA1SPTRL_SPTR2_MASK                     equ 0004h
DMA1SPTRL_SPTR3_POSN                     equ 0003h
DMA1SPTRL_SPTR3_POSITION                 equ 0003h
DMA1SPTRL_SPTR3_SIZE                     equ 0001h
DMA1SPTRL_SPTR3_LENGTH                   equ 0001h
DMA1SPTRL_SPTR3_MASK                     equ 0008h
DMA1SPTRL_SPTR4_POSN                     equ 0004h
DMA1SPTRL_SPTR4_POSITION                 equ 0004h
DMA1SPTRL_SPTR4_SIZE                     equ 0001h
DMA1SPTRL_SPTR4_LENGTH                   equ 0001h
DMA1SPTRL_SPTR4_MASK                     equ 0010h
DMA1SPTRL_SPTR5_POSN                     equ 0005h
DMA1SPTRL_SPTR5_POSITION                 equ 0005h
DMA1SPTRL_SPTR5_SIZE                     equ 0001h
DMA1SPTRL_SPTR5_LENGTH                   equ 0001h
DMA1SPTRL_SPTR5_MASK                     equ 0020h
DMA1SPTRL_SPTR6_POSN                     equ 0006h
DMA1SPTRL_SPTR6_POSITION                 equ 0006h
DMA1SPTRL_SPTR6_SIZE                     equ 0001h
DMA1SPTRL_SPTR6_LENGTH                   equ 0001h
DMA1SPTRL_SPTR6_MASK                     equ 0040h
DMA1SPTRL_SPTR7_POSN                     equ 0007h
DMA1SPTRL_SPTR7_POSITION                 equ 0007h
DMA1SPTRL_SPTR7_SIZE                     equ 0001h
DMA1SPTRL_SPTR7_LENGTH                   equ 0001h
DMA1SPTRL_SPTR7_MASK                     equ 0080h
DMA1SPTRL_DMA1SPTR_POSN                  equ 0000h
DMA1SPTRL_DMA1SPTR_POSITION              equ 0000h
DMA1SPTRL_DMA1SPTR_SIZE                  equ 0008h
DMA1SPTRL_DMA1SPTR_LENGTH                equ 0008h
DMA1SPTRL_DMA1SPTR_MASK                  equ 00FFh
DMA1SPTRL_DMA1SPTR0_POSN                 equ 0000h
DMA1SPTRL_DMA1SPTR0_POSITION             equ 0000h
DMA1SPTRL_DMA1SPTR0_SIZE                 equ 0001h
DMA1SPTRL_DMA1SPTR0_LENGTH               equ 0001h
DMA1SPTRL_DMA1SPTR0_MASK                 equ 0001h
DMA1SPTRL_DMA1SPTR1_POSN                 equ 0001h
DMA1SPTRL_DMA1SPTR1_POSITION             equ 0001h
DMA1SPTRL_DMA1SPTR1_SIZE                 equ 0001h
DMA1SPTRL_DMA1SPTR1_LENGTH               equ 0001h
DMA1SPTRL_DMA1SPTR1_MASK                 equ 0002h
DMA1SPTRL_DMA1SPTR2_POSN                 equ 0002h
DMA1SPTRL_DMA1SPTR2_POSITION             equ 0002h
DMA1SPTRL_DMA1SPTR2_SIZE                 equ 0001h
DMA1SPTRL_DMA1SPTR2_LENGTH               equ 0001h
DMA1SPTRL_DMA1SPTR2_MASK                 equ 0004h
DMA1SPTRL_DMA1SPTR3_POSN                 equ 0003h
DMA1SPTRL_DMA1SPTR3_POSITION             equ 0003h
DMA1SPTRL_DMA1SPTR3_SIZE                 equ 0001h
DMA1SPTRL_DMA1SPTR3_LENGTH               equ 0001h
DMA1SPTRL_DMA1SPTR3_MASK                 equ 0008h
DMA1SPTRL_DMA1SPTR4_POSN                 equ 0004h
DMA1SPTRL_DMA1SPTR4_POSITION             equ 0004h
DMA1SPTRL_DMA1SPTR4_SIZE                 equ 0001h
DMA1SPTRL_DMA1SPTR4_LENGTH               equ 0001h
DMA1SPTRL_DMA1SPTR4_MASK                 equ 0010h
DMA1SPTRL_DMA1SPTR5_POSN                 equ 0005h
DMA1SPTRL_DMA1SPTR5_POSITION             equ 0005h
DMA1SPTRL_DMA1SPTR5_SIZE                 equ 0001h
DMA1SPTRL_DMA1SPTR5_LENGTH               equ 0001h
DMA1SPTRL_DMA1SPTR5_MASK                 equ 0020h
DMA1SPTRL_DMA1SPTR6_POSN                 equ 0006h
DMA1SPTRL_DMA1SPTR6_POSITION             equ 0006h
DMA1SPTRL_DMA1SPTR6_SIZE                 equ 0001h
DMA1SPTRL_DMA1SPTR6_LENGTH               equ 0001h
DMA1SPTRL_DMA1SPTR6_MASK                 equ 0040h
DMA1SPTRL_DMA1SPTR7_POSN                 equ 0007h
DMA1SPTRL_DMA1SPTR7_POSITION             equ 0007h
DMA1SPTRL_DMA1SPTR7_SIZE                 equ 0001h
DMA1SPTRL_DMA1SPTR7_LENGTH               equ 0001h
DMA1SPTRL_DMA1SPTR7_MASK                 equ 0080h

